jonacappelle/nRF52-BLE-IMU/BLE/usr_ble.c
// Bool to keep track if data over BLE NUS is send correctly
bool NUS_send_OK = true;

// CUSTOM
uint32_t nus_printf_custom(char* p_char)
{
		static uint16_t index;
		uint32_t err_code;
		static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
		while(*p_char != '\0'){
						data_array[index] = *p_char;
						index++;
						p_char++;
						}

		err_code = ble_nus_data_send(&m_nus, data_array, &index, m_conn_handle);
		
		// Check for errors
		if ((err_code != NRF_ERROR_INVALID_STATE) &&
				(err_code != NRF_ERROR_RESOURCES) &&
				(err_code != NRF_ERROR_NOT_FOUND))
		{
				APP_ERROR_CHECK(err_code);
		}
				
		index = 0;
		return err_code;
}

// CUSTOM
uint32_t nus_printf_custom_1(char* p_char)
{
	static uint16_t index;
	uint32_t err_code;
	static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
	while(*p_char != '\0'){
          data_array[index] = *p_char;
          index++;
          p_char++;
          }			
			do
			{
					err_code = ble_nus_data_send(&m_nus, data_array, &index, m_conn_handle);
					if ((err_code != NRF_ERROR_INVALID_STATE) &&
							(err_code != NRF_ERROR_RESOURCES) &&
							(err_code != NRF_ERROR_NOT_FOUND))
					{
							APP_ERROR_CHECK(err_code);
					}
			} while (err_code == NRF_SUCCESS);
		
			NRF_LOG_INFO("C:	%d", countrrr);
	countrrr++;
		index = 0;
	return err_code;
}

uint32_t nus_send(uint8_t * data, uint16_t len)
{
		uint32_t err_code;
	
		err_code = ble_nus_data_send(&m_nus, data, &len, m_conn_handle);
		
		// Check for errors
		if ((err_code != NRF_ERROR_INVALID_STATE) &&
				(err_code != NRF_ERROR_RESOURCES) &&
				(err_code != NRF_ERROR_NOT_FOUND))
		{
				APP_ERROR_CHECK(err_code);
		}
		return err_code;
}





uint32_t usr_ble_init(void)
{
    bool erase_bonds;
    uint32_t err_code;

    uart_init();
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();

    ble_stack_init();
    gap_params_init();
    gatt_init();
    
    // Init NUS services and standard services
    services_init();

    NRF_LOG_DEBUG("DEBUG enabled in preprocessor");
    NRF_LOG_FLUSH();

    // Init TMS service
    err_code = usr_tms_init();
    APP_ERROR_CHECK(err_code);
    NRF_LOG_DEBUG("usr_tms_init done");

    err_code = usr_bas_init();
    APP_ERROR_CHECK(err_code);
    NRF_LOG_DEBUG("usr_bas_init done");

    advertising_init();
    NRF_LOG_DEBUG("advertising_init done");
    conn_params_init();
    NRF_LOG_DEBUG("conn_params_init done");

    // TimeSync
    sync_timer_init();
    NRF_LOG_DEBUG("sync_timer_button_init done");

    advertising_start();
    NRF_LOG_DEBUG("advertising_start done");

    return NRF_SUCCESS;
}


